DimaFantasy/LPP/LPP_STM32F103C8Tx/Core/Src/main.c
}

/**
  * @brief TIM4 Initialization Function
  * @param None
  * @retval None
  */
static void MX_TIM4_Init(void)
{

  /* USER CODE BEGIN TIM4_Init 0 */
  /* USER CODE END TIM4_Init 0 */

  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};

  /* USER CODE BEGIN TIM4_Init 1 */
  /* USER CODE END TIM4_Init 1 */
  htim4.Instance = TIM4;
  htim4.Init.Prescaler = 72;
  htim4.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim4.Init.Period = 10000;
  htim4.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim4.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&htim4) != HAL_OK)
  {
    Error_Handler();
  }
  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&htim4, &sClockSourceConfig) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_TIM_OnePulse_Init(&htim4, TIM_OPMODE_SINGLE) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim4, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN TIM4_Init 2 */
  /* USER CODE END TIM4_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  /* USER CODE BEGIN MX_GPIO_Init_1 */

  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();

  /* USER CODE BEGIN MX_GPIO_Init_2 */
  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/**
 ******************************************************************************
 * @file    lpp_sdk_f103.c
 * @brief   Реализация аппаратного уровня LPP для STM32F103 (Blue Pill)
 ******************************************************************************
 */

// Глобальные переменные SDK
volatile uint32_t dma_pwm_masks[3][2] = {0}; // [Laser, LED1, LED2][SET, RESET]
uint32_t raw_pin_masks[3] = {0};             // Маски пинов (1 << N)
uint32_t LAST_LASER_FREQ = 0;
volatile int32_t X_PWM_CURRENT = 0;

// ============================================================================
// СЕКЦИЯ: СВЯЗЬ (USB HID)
// ============================================================================

/**
 * @brief Отправка 64-байтного пакета хосту
 */
uint8_t PacketSend(uint8_t* buffer) {
    // На F103 используется стандартная функция HID-класса
    return USBD_CUSTOM_HID_SendReport(&hUsbDeviceFS, buffer, 64);	
}

// ============================================================================
// СЕКЦИЯ: МОТОР ОСИ X (TIM2)
// ============================================================================

void XMotorInit(X_MOTOR_MODE_T mode) {
    if (X_MOTOR_MODE == mode) return;

    // 1. Сначала глушим прерывание в NVIC — ДО сброса таймера
    HAL_NVIC_DisableIRQ(TIM2_IRQn);
//    __HAL_TIM_DISABLE(&htim2); // Выключить таймер ПЕРЕД сбросом	
    HAL_NVIC_ClearPendingIRQ(TIM2_IRQn); // ← убираем застрявший pending

    __HAL_RCC_TIM2_FORCE_RESET();
    __HAL_RCC_TIM2_RELEASE_RESET();
    __HAL_RCC_TIM2_CLK_ENABLE();

    TIM2->CR1  = 0;
    TIM2->CR2  = 0;
    TIM2->DIER = 0;
    TIM2->SR   = 0;
    TIM2->CCER = 0;
    X_PWM_CURRENT = 0;
	

    htim2.Instance = TIM2;
    htim2.Init.CounterMode    = TIM_COUNTERMODE_UP;
    htim2.Init.ClockDivision  = TIM_CLOCKDIVISION_DIV1;
    // F103: RepetitionCounter не существует у TIM2 — убираем или ставим 0 если HAL требует
    htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;

    if (mode == X_MOTOR_MODE_STEP) {
        // 72МГц / 72 = 1МГц → 1 тик = 1 мкс
        htim2.Init.Prescaler = 71;
        htim2.Init.Period    = 10000;

        HAL_TIM_OnePulse_Init(&htim2, TIM_OPMODE_SINGLE);

        HAL_NVIC_SetPriority(TIM2_IRQn, 5, 0);
        HAL_NVIC_EnableIRQ(TIM2_IRQn);
        __HAL_TIM_ENABLE_IT(&htim2, TIM_IT_UPDATE);

        TIM2->EGR |= TIM_EGR_UG;
        TIM2->SR   = 0;
				TIM2->DIER |= TIM_DIER_UIE; // Включаем ПОСЛЕ сброса SR
        // НЕ запускаем CEN здесь — запуск только через XTimerSet
        // (иначе сразу стреляет UIF с дефолтным ARR)
				// Тестовый толчок 
				TIM2->ARR  = 100;   // 100 мкс
				TIM2->CR1 |= TIM_CR1_CEN; // Старт одного импульса
    }
    else {
        // 72МГц / 14 ≈ 5.14МГц, период 5000 тиков ≈ ~1кГц ШИМ
        htim2.Init.Prescaler = 13;
        htim2.Init.Period    = 5001;
        HAL_TIM_Base_Init(&htim2);

        TIM2->CR1 &= ~TIM_CR1_OPM; // Непрерывный режим

        TIM_OC_InitTypeDef sConfigOC = {0};
        sConfigOC.OCMode = TIM_OCMODE_TIMING;
        sConfigOC.Pulse  = 2500; // Старт 50%
        HAL_TIM_OC_ConfigChannel(&htim2, &sConfigOC, TIM_CHANNEL_1);

        TIM2->CR1   |= TIM_CR1_ARPE;
        TIM2->CCMR1 |= TIM_CCMR1_OC1PE;

        HAL_NVIC_SetPriority(TIM2_IRQn, 5, 0);
        HAL_NVIC_EnableIRQ(TIM2_IRQn);
        __HAL_TIM_ENABLE_IT(&htim2, TIM_IT_UPDATE | TIM_IT_CC1);

        TIM2->EGR |= TIM_EGR_UG;
        TIM2->SR   = 0;
        TIM2->CR1 |= TIM_CR1_CEN;
    }

    X_MOTOR_MODE = mode;
}

/**
 * @brief DeadTime ~1 мкс на F103 @ 72МГц
 * F411 использовал 60 NOP @ 100МГц ≈ 0.6 мкс
 * F103 @ 72МГц: ~50 NOP ≈ ~0.7 мкс (pipeline короче, нет суперскалярности)
 * Подберите экспериментально осциллографом!
 */
__STATIC_INLINE void XMotorDeadTime(void) {
    for (volatile int i = 0; i < 50; i++) { __NOP(); }
}

//// Надёжный вариант через DWT (если включен)
///**
// * @brief Универсальный DeadTime на базе тактов ядра (DWT)
// * Работает на F103 (72MHz), F411 (100MHz), G431 (170MHz)
// */
//__STATIC_INLINE void XMotorDeadTime(void) {
//    // 1. Рассчитываем количество тактов для 1 мкс.
//    // SystemCoreClock / 1000000 дает количество тактов в 1 мкс.
//    uint32_t ticks = (SystemCoreClock / 1000000) * 1; // *1 = 1 мкс.

//    // 2. Ждем завершения отсчета тактов
//    uint32_t start = DWT->CYCCNT;
//    while ((DWT->CYCCNT - start) < ticks);
//}

void TIM2_IRQHandler(void) {
    uint32_t sr = TIM2->SR;

    if (sr & TIM_SR_UIF) {
        TIM2->SR = ~TIM_SR_UIF;

        XTimerCallback();

