DimaFantasy/LPP/LPP_STM32F103C8Tx/Core/Src/main.c
        if (X_MOTOR_MODE != X_MOTOR_MODE_STEP) {
            F_RESET_PIN(&g_pins[PIN_X_MO_L]);
            F_RESET_PIN(&g_pins[PIN_X_MO_R]);
            F_RESET_PIN(&g_pins[PIN_X_MO_L_H]);
            F_RESET_PIN(&g_pins[PIN_X_MO_R_H]);

            if (X_PWM_CURRENT != 0) {
                XMotorDeadTime();

                int32_t raw_pwr  = (W_X_POL_PWM == 0) ? X_PWM_CURRENT : -X_PWM_CURRENT;
                uint32_t abs_pwr = (uint32_t)abs(raw_pwr);
                if (abs_pwr > 5000) abs_pwr = 5000;

                TIM2->CCR1 = abs_pwr;

                if (X_MOTOR_MODE == X_MOTOR_MODE_TWO_PWM) {
                    if (raw_pwr > 0) {
                        F_SET_PIN(&g_pins[PIN_X_MO_L]);
                        F_SET_PIN(&g_pins[PIN_X_MO_R_H]);
                    } else {
                        F_SET_PIN(&g_pins[PIN_X_MO_R]);
                        F_SET_PIN(&g_pins[PIN_X_MO_L_H]);
                    }
                }
                else if (X_MOTOR_MODE == X_MOTOR_MODE_ONE_PWM) {
                    F_SET_PIN(&g_pins[PIN_X_MO_L]);
                    uint8_t dir = (raw_pwr >= 0) ? 0 : 1;
                    if (W_X_POL_DIR) dir = !dir;
                    if (dir) F_SET_PIN(&g_pins[PIN_X_MO_R]);
                    else     F_RESET_PIN(&g_pins[PIN_X_MO_R]);
                }
            }
        }
    }

    if (sr & TIM_SR_CC1IF) {
        TIM2->SR = ~TIM_SR_CC1IF;

        if (X_MOTOR_MODE != X_MOTOR_MODE_STEP) {
            F_RESET_PIN(&g_pins[PIN_X_MO_L]);
            F_RESET_PIN(&g_pins[PIN_X_MO_R]);
            F_RESET_PIN(&g_pins[PIN_X_MO_L_H]);
            F_RESET_PIN(&g_pins[PIN_X_MO_R_H]);
        }
    }
}

void XTimerSet(uint16_t period) {
    if (X_MOTOR_MODE == X_MOTOR_MODE_STEP) {
        __HAL_TIM_SET_AUTORELOAD(&htim2, period);
        __HAL_TIM_ENABLE(&htim2);
    }
}

void XMotorSet(int power) {
    if (X_MOTOR_MODE == X_MOTOR_MODE_STEP) return;

    if (power >  5000) power =  5000;
    if (power < -5000) power = -5000;

    X_PWM_CURRENT = power;
    TIM2->CCR1    = (uint32_t)abs(power);

    if (power == 0) {
        F_RESET_PIN(&g_pins[PIN_X_MO_L]);
        F_RESET_PIN(&g_pins[PIN_X_MO_R]);
        F_RESET_PIN(&g_pins[PIN_X_MO_L_H]);
        F_RESET_PIN(&g_pins[PIN_X_MO_R_H]);
    }
}

// ============================================================================
// СЕКЦИЯ: ЛАЗЕР И ПОДСВЕТКА (TIM1 + DMA1)
// ============================================================================

// ============================================================================
// Принцип работы:
// 1. LASER: Включение по TIM1_UP (0), выключение по CCR1 (val).
// 2. LED1/LED2: "Инверсная" логика для общего сброса.
//    - Включение: Каждому свой CCR (CCR4 для LED1, CCR3 для LED2).
//    - Точка включения = (100 - val). Чем больше яркость, тем раньше старт.
//    - Выключение: ОБЩЕЕ по CCR2 (всегда 100) через один канал DMA.
//
// Ограничения:
// - LASER: Любой порт, любой пин.
// - LED1 & LED2: Обязательно на одном GPIO порту (используют общий BSRR).
// ============================================================================

// F103 маппинг TIM1 → DMA1 (жёстко в железе, не меняется):
void PWM_LaserLight_LinkHardware(void) {
    PIN_CFG_T *laser = &g_pins[PIN_PWM_LASER];
    PIN_CFG_T *led1  = &g_pins[PIN_PWM_LED1];
    PIN_CFG_T *led2  = &g_pins[PIN_PWM_LED2];

    // 1. Останавливаем все каналы DMA перед перенастройкой
    DMA1_Channel5->CCR &= ~DMA_CCR_EN; // Laser ON
    DMA1_Channel2->CCR &= ~DMA_CCR_EN; // Laser OFF
    DMA1_Channel4->CCR &= ~DMA_CCR_EN; // LED1 ON
    DMA1_Channel3->CCR &= ~DMA_CCR_EN; // Common LED OFF (CH2)
    DMA1_Channel6->CCR &= ~DMA_CCR_EN; // LED2 ON

    // Сброс флагов
    DMA1->IFCR = DMA_IFCR_CGIF2 | DMA_IFCR_CGIF3 | DMA_IFCR_CGIF4 |
                 DMA_IFCR_CGIF5 | DMA_IFCR_CGIF6;

    uint32_t ccr_base = DMA_CCR_DIR | DMA_CCR_CIRC | DMA_CCR_MSIZE_1 | 
                        DMA_CCR_PSIZE_1 | DMA_CCR_PL_Msk;

    // ----------------------------------------------------------------
    // ЛАЗЕР (Любой порт/пин)
    // ----------------------------------------------------------------
    if (laser->used && laser->bsrr != &GPIO_NULL_REG) {
        raw_pin_masks[0] = laser->pin;
        DMA1_Channel5->CPAR  = (uint32_t)laser->bsrr;
        DMA1_Channel5->CMAR  = (uint32_t)&dma_pwm_masks[0][0];
        DMA1_Channel5->CNDTR = 1;
        DMA1_Channel5->CCR   = ccr_base | DMA_CCR_EN;

        DMA1_Channel2->CPAR  = (uint32_t)laser->bsrr;
        DMA1_Channel2->CMAR  = (uint32_t)&dma_pwm_masks[0][1];
        DMA1_Channel2->CNDTR = 1;
        DMA1_Channel2->CCR   = ccr_base | DMA_CCR_EN;
    }

    // ----------------------------------------------------------------
    // ПОДСВЕТКА (LED1 и LED2)
    // ----------------------------------------------------------------
    
    // Проверка совместимости портов
    bool led1_active = (led1->used && led1->bsrr != &GPIO_NULL_REG);
    bool led2_active = (led2->used && led2->bsrr != &GPIO_NULL_REG);
    
    // Если оба активны, но порты РАЗНЫЕ — блокируем инициализацию подсветки
    if (led1_active && led2_active && (led1->bsrr != led2->bsrr)) {
        return; // Защита: порты не совпадают, ШИМ через общий сброс невозможен
    }

    // Настройка LED1
    if (led1_active) {
        raw_pin_masks[1] = led1->pin;
        // ON: TIM1_CH4
        DMA1_Channel4->CPAR  = (uint32_t)led1->bsrr;
        DMA1_Channel4->CMAR  = (uint32_t)&dma_pwm_masks[1][0];
        DMA1_Channel4->CNDTR = 1;
        DMA1_Channel4->CCR   = ccr_base | DMA_CCR_EN;

        // OFF: TIM1_CH2 (Общий канал выключения)
        DMA1_Channel3->CPAR  = (uint32_t)led1->bsrr;
        DMA1_Channel3->CMAR  = (uint32_t)&dma_pwm_masks[1][1];
        DMA1_Channel3->CNDTR = 1;
        DMA1_Channel3->CCR   = ccr_base | DMA_CCR_EN;
    }

    // Настройка LED2
    if (led2_active) {
        raw_pin_masks[2] = led2->pin;
        // ON: TIM1_CH3
        DMA1_Channel6->CPAR  = (uint32_t)led2->bsrr;
        DMA1_Channel6->CMAR  = (uint32_t)&dma_pwm_masks[2][0];
        DMA1_Channel6->CNDTR = 1;
        DMA1_Channel6->CCR   = ccr_base | DMA_CCR_EN;

