DimaFantasy/LPP/LPP_STM32F103C8Tx/Core/Src/main.c
        // Если LED1 не используется, настраиваем канал OFF на порт LED2
        if (!led1_active) {
            DMA1_Channel3->CPAR  = (uint32_t)led2->bsrr;
            DMA1_Channel3->CMAR  = (uint32_t)&dma_pwm_masks[1][1];
            DMA1_Channel3->CNDTR = 1;
            DMA1_Channel3->CCR   = ccr_base | DMA_CCR_EN;
        }
    }
}

void SetLaserLightPWMFrequency(uint32_t freq_hz) {
    if (freq_hz == LAST_LASER_FREQ && freq_hz != 0) return;

    if (freq_hz == 0) {
        TIM1->CR1 &= ~TIM_CR1_CEN;
        LAST_LASER_FREQ = 0;
        return;
    }

    __HAL_RCC_TIM1_CLK_ENABLE();
    __HAL_RCC_DMA1_CLK_ENABLE();

		uint32_t arr = 100; // Наш диапазон 0-100%
    uint32_t psc_val = 72000000 / (freq_hz * (arr + 1));

    
    TIM1->CR1  &= ~TIM_CR1_CEN; 
    TIM1->PSC   = (psc_val > 0) ? psc_val - 1 : 0;
    TIM1->ARR   = arr;
    
    // Начальные безопасные значения:
    TIM1->CCR1  = 0;   // Laser OFF (управляется в SetLaserPWM)
    TIM1->CCR2  = 100; // Точка ОБЩЕГО СБРОСА для LED1 и LED2 (всегда конец периода)
    TIM1->CCR3  = 100; // Точка включения LED2 (по умолчанию 100 = выключен)
    TIM1->CCR4  = 100; // Точка включения LED1 (по умолчанию 100 = выключен)

    // DMA запросы от таймера
    TIM1->DIER = TIM_DIER_UDE    |  // Update  → Ch5 (Laser ON)
                 TIM_DIER_CC1DE  |  // CCR1    → Ch2 (Laser OFF)
                 TIM_DIER_CC2DE  |  // CCR2    → Ch3 (LED1 OFF + LED2 OFF)
                 TIM_DIER_CC3DE  |  // CCR3    → Ch6 (LED2 ON)
                 TIM_DIER_CC4DE;    // CCR4    → Ch4 (LED1 ON)

    PWM_LaserLight_LinkHardware();

    TIM1->BDTR |= TIM_BDTR_MOE;
    TIM1->EGR  |= TIM_EGR_UG;  // Загрузить PSC/ARR/CCR
    TIM1->SR    = 0;
    TIM1->CR1  |= TIM_CR1_CEN;

    LAST_LASER_FREQ = freq_hz;
}

// ============================================================================
// Управление мощностью
// ============================================================================

void Laser_Off(void) {
    LASER_SAFETY_LOCK = 1;
    HAL_TIM_Base_Stop_IT(&htim3);
    SetLaserPWM(0);
    TIM1->EGR |= TIM_EGR_UG;
    F_RESET_PIN(&g_pins[PIN_PWM_LASER]);
}

void Laser_Ready(void) {
    TIM3->CNT = 0;
    TIM1->CNT = 0;
    TIM1->EGR |= TIM_EGR_UG;
    LASER_SAFETY_LOCK = 0;
}

inline void SetLaserPWM(uint16_t val) {
    if (LASER_SAFETY_LOCK) val = 0;
    if (val > 100) val = 100;

    dma_pwm_masks[0][0] = (val > 0)   ? raw_pin_masks[0]        : 0; // SET
    dma_pwm_masks[0][1] = (val < 100) ? (raw_pin_masks[0] << 16): 0; // RESET

    TIM1->CCR1 = val;
    if (val == 0) F_RESET_PIN(&g_pins[PIN_PWM_LASER]);
}

inline void SetLight1PWM(uint16_t val) {
    if (val > 100) val = 100;
    
    // 1. Устанавливаем точку включения. 
    // Для 100% ставим 1, чтобы не мешать Laser ON в 0-м такте.
    TIM1->CCR4 = (val < 100) ? (100 - val) : 1; 

    // 2. Маска включения (SET)
    dma_pwm_masks[1][0] = (val > 0) ? raw_pin_masks[1] : 0;

    // 3. Маска выключения (RESET) в общем канале (DMA1_Ch3)
    // Для себя: сбрасываем, только если яркость ниже 100%
    uint32_t r1 = (val < 100) ? (raw_pin_masks[1] << 16) : 0;
    
    // Для соседа: сбрасываем, если его CCR3 > 1 (значит его яркость < 100%)
    uint32_t r2 = (TIM1->CCR3 > 1 && raw_pin_masks[2]) ? (raw_pin_masks[2] << 16) : 0;
    
    dma_pwm_masks[1][1] = r1 | r2;

    // Если 0 — гарантированно тушим пин
    if (val == 0) F_RESET_PIN(&g_pins[PIN_PWM_LED1]);
}

inline void SetLight2PWM(uint16_t val) {
    if (val > 100) val = 100;

    // 1. Точка включения
    TIM1->CCR3 = (val < 100) ? (100 - val) : 1; 

    // 2. Маска включения (SET)
    dma_pwm_masks[2][0] = (val > 0) ? raw_pin_masks[2] : 0;

    // 3. Общая маска выключения (RESET)
    // Для соседа (LED1): смотрим на его CCR4
    uint32_t r1 = (TIM1->CCR4 > 1 && raw_pin_masks[1]) ? (raw_pin_masks[1] << 16) : 0;
    
    // Для себя: смотрим на свой val
    uint32_t r2 = (val < 100) ? (raw_pin_masks[2] << 16) : 0;
    
    dma_pwm_masks[1][1] = r1 | r2;

    if (val == 0) F_RESET_PIN(&g_pins[PIN_PWM_LED2]);
}

// ============================================================================
// СЕКЦИЯ: DMA M2M (Копирование пакетов)
// ============================================================================

void DMA_M2M_Init(void) {
    __HAL_RCC_DMA1_CLK_ENABLE();
}

void FIFO_DATA_StartDma(uint32_t src, uint32_t dst, uint16_t count) {
    DMA1_Channel1->CCR &= ~DMA_CCR_EN;
    DMA1->IFCR = DMA_IFCR_CGIF1; // Сброс флагов
    
    DMA1_Channel1->CPAR = src;
    DMA1_Channel1->CMAR = dst;
    DMA1_Channel1->CNDTR = count;
    
    // M2M, Low Priority, 8-bit, MINC, PINC, TCIE
    DMA1_Channel1->CCR = DMA_CCR_MEM2MEM | DMA_CCR_MINC | DMA_CCR_PINC | 
                         DMA_CCR_TCIE | DMA_CCR_TEIE;
    
    HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);
    DMA1_Channel1->CCR |= DMA_CCR_EN;
}

void DMA1_Channel1_IRQHandler(void) {
    if (DMA1->ISR & DMA_ISR_TCIF1) {
        DMA1->IFCR = DMA_IFCR_CTCIF1;
        FIFO_DATA_EndDma(); // Callback готовности данных
    }
}

// ============================================================================
// СЕКЦИЯ: ИНТЕРПОЛЯЦИЯ И Y-ОСЬ
// ============================================================================

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef* htim) {
    if (htim->Instance == TIM3) {
        if (XInterpTimerCallback() == 0) {
            HAL_TIM_Base_Stop_IT(&htim3);
            TIM3->CNT = 0;
        }
    }
    if (htim->Instance == TIM4) {
        YTimerCallback();
    }
}

void YTimerSet(uint16_t period) {
    __HAL_TIM_SET_AUTORELOAD(&htim4, period);
    __HAL_TIM_ENABLE(&htim4);
}

void XInterpTimerStart(uint32_t period) {
    TIM3->ARR = period;
    TIM3->SR &= ~TIM_SR_UIF;
    TIM3->DIER |= TIM_DIER_UIE;
    TIM3->CR1 |= TIM_CR1_CEN;
}

// ============================================================================
// ОБРАБОТЧИКИ ПРЕРЫВАНИЙ EXTI (Энкодер)
// ============================================================================

void LPP_GPIO_EXTI_Handler(uint16_t pin_mask) {
    XEncoderCallback(pin_mask); 
}

void EXTI0_IRQHandler(void) { __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_0); LPP_GPIO_EXTI_Handler(GPIO_PIN_0); }
void EXTI1_IRQHandler(void) { __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_1); LPP_GPIO_EXTI_Handler(GPIO_PIN_1); }
void EXTI2_IRQHandler(void) { __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_2); LPP_GPIO_EXTI_Handler(GPIO_PIN_2); }
void EXTI3_IRQHandler(void) { __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_3); LPP_GPIO_EXTI_Handler(GPIO_PIN_3); }
void EXTI4_IRQHandler(void) { __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_4); LPP_GPIO_EXTI_Handler(GPIO_PIN_4); }
void EXTI9_5_IRQHandler(void) {
    uint32_t pin = EXTI->PR & 0x03E0;
    EXTI->PR = pin; LPP_GPIO_EXTI_Handler(pin);
}
void EXTI15_10_IRQHandler(void) {
    uint32_t pin = EXTI->PR & 0xFC00;
    EXTI->PR = pin; LPP_GPIO_EXTI_Handler(pin);
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
////////////////////////////////////////////////////////////////    __disable_irq();
    while (1) {
    }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
